## Sorting Data

Let us understand how to sort the data using **SQL**.

* We typically perform sorting as final step.

* Sorting can be done either by using one field or multiple fields. Sorting by multiple fields is also known as composite sorting.

* As part of composite sorting, we can sort the data in ascending order on some fields and descending order on other fields.

* We can sort the data either in `ascending` order or `descending` order by using column or expression.

* By default, the sorting order is `ascending` and we can change it to `descending` by using `DESC`.

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

env: DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

* Get Completed Orders Per Day in Descending order

In [3]:
%%sql

SELECT 
    order_date, 
    COUNT(1) AS order_count
FROM 
    orders
WHERE 
    order_status IN ('COMPLETE', 'CLOSED')
GROUP BY 
    order_date
ORDER BY 
    order_count DESC
LIMIT 10

10 rows affected.

[(datetime.datetime(2013, 11, 3, 0, 0), 146),
 (datetime.datetime(2013, 10, 4, 0, 0), 127),
 (datetime.datetime(2013, 9, 14, 0, 0), 126),
 (datetime.datetime(2013, 11, 5, 0, 0), 126),
 (datetime.datetime(2013, 11, 11, 0, 0), 125),
 (datetime.datetime(2013, 11, 14, 0, 0), 125),
 (datetime.datetime(2013, 11, 30, 0, 0), 125),
 (datetime.datetime(2014, 6, 19, 0, 0), 124),
 (datetime.datetime(2014, 5, 6, 0, 0), 123),
 (datetime.datetime(2014, 4, 21, 0, 0), 123)]

* Composite Sorting

In [4]:
%%sql

SELECT 
    * 
FROM 
    orders
ORDER BY 
    order_customer_id ASC,
    order_date DESC
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(22945, datetime.datetime(2013, 12, 13, 0, 0), 1, 'COMPLETE'),
 (33865, datetime.datetime(2014, 2, 18, 0, 0), 2, 'COMPLETE'),
 (67863, datetime.datetime(2013, 11, 30, 0, 0), 2, 'COMPLETE'),
 (15192, datetime.datetime(2013, 10, 29, 0, 0), 2, 'PENDING_PAYMENT'),
 (57963, datetime.datetime(2013, 8, 2, 0, 0), 2, 'ON_HOLD'),
 (57617, datetime.datetime(2014, 7, 24, 0, 0), 3, 'COMPLETE'),
 (56178, datetime.datetime(2014, 7, 15, 0, 0), 3, 'PENDING'),
 (46399, datetime.datetime(2014, 5, 9, 0, 0), 3, 'PROCESSING'),
 (35158, datetime.datetime(2014, 2, 26, 0, 0), 3, 'COMPLETE'),
 (23662, datetime.datetime(2013, 12, 19, 0, 0), 3, 'COMPLETE')]

* Get Revenue per day per product in Ascending Order of Date and Descending of Revenue

In [5]:
%%sql

SELECT
    o.order_date,
    oi.order_item_product_id,
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) AS revenue
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY 
    o.order_date,
    oi.order_item_product_id
ORDER BY 
    o.order_date,
    revenue DESC
LIMIT 
    5

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
5 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'))]

* Sort Data with Conditional statements

In [6]:
%%sql

DROP TABLE IF EXISTS users;

CREATE TABLE 
    users (user_id SERIAL PRIMARY KEY,
           user_first_name VARCHAR(30) NOT NULL,
           user_last_name VARCHAR(30) NOT NULL,
           user_email_id VARCHAR(50) NOT NULL,
           user_email_validated BOOLEAN DEFAULT FALSE,
           user_password VARCHAR(200),
           user_role VARCHAR(1) NOT NULL DEFAULT 'U', --U and A
           user_country VARCHAR(2),
           is_active BOOLEAN DEFAULT FALSE,
           create_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
           last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP
          );

INSERT INTO 
    users (user_first_name, user_last_name, user_email_id, user_country)
VALUES 
    ('Donald', 'Duck', 'donald@duck.com', 'IN');

INSERT INTO 
    users (user_first_name, user_last_name, user_email_id, user_role, is_active, user_country)
VALUES 
    ('Mickey', 'Mouse', 'mickey@mouse.com', 'U', true, 'US');

INSERT INTO 
    users (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active, user_country) 
VALUES 
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true, 'CA'),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true, 'FR'),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true, 'AU');

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
Done.
Done.
1 rows affected.
1 rows affected.
3 rows affected.

[]

In [7]:
%%sql

SELECT 
    user_id,
    user_first_name,
    user_last_name,
    user_email_id,
    user_country
FROM
    users
ORDER BY
    CASE 
        WHEN 
            user_country = 'US' 
        THEN 
            0
        ELSE 
            1
    END, user_country

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
5 rows affected.

[(2, 'Mickey', 'Mouse', 'mickey@mouse.com', 'US'),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', 'AU'),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'CA'),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'FR'),
 (1, 'Donald', 'Duck', 'donald@duck.com', 'IN')]